{
  "backend/main.mo": "Main canister actor handling user profiles, history storage capped at 30 entries, permissions, and Big/Small prediction logic.",
  "backend/migration.mo": "Migration module that trims old history lists to a maximum of 30 entries while preserving user profiles.",
  "feature_evidence.json": "Feature evidence report mapping feature changes to affected frontend files and components with test coverage metadata.",
  "frontend-file-summaries.txt": "Prewritten summaries of all frontend files describing their roles in history flow, prediction, UI, and infrastructure.",
  "frontend/index.css": "Empty stylesheet placeholder for global styles.",
  "frontend/index.html": "HTML entry point with a loading fallback and script bootstrap for the React application.",
  "frontend/src/App.tsx": "Main React component wiring history, prediction, connection state, and gated input flow into the UI layout.",
  "frontend/src/components/AppErrorBoundary.tsx": "React error boundary that catches render failures and shows a recovery UI with a reload button.",
  "frontend/src/features/auth/LoginButton.tsx": "Empty placeholder file for the login button component.",
  "frontend/src/features/auth/ProfileSetupDialog.tsx": "Empty placeholder file for the profile setup dialog component.",
  "frontend/src/features/auth/useCallerUserProfile.ts": "Empty placeholder file for the user profile hook.",
  "frontend/src/features/disclaimer/Disclaimer.tsx": "UI card displaying a disclaimer about heuristic predictions and non‑guaranteed accuracy.",
  "frontend/src/features/history/HistoryControls.tsx": "UI controls for adding Big/Small entries, triggering prediction, and handling the 30-entry gate flow with connection and loading states.",
  "frontend/src/features/history/historyTypes.ts": "Defines the Big/Small result type and helpers for validating and normalizing input strings.",
  "frontend/src/features/history/useGatedHistoryFlow.ts": "Manages the 30-entry gating logic, unlocking exactly one additional entry after pressing Next and relocking afterward.",
  "frontend/src/features/history/useLocalHistory.ts": "Maintains local rolling history of up to 30 items with helpers to add, remove, clear, and replace history entries.",
  "frontend/src/features/history/useRemoteHistory.ts": "Empty placeholder file for remote history functionality.",
  "frontend/src/features/prediction/predictionFlow.check.ts": "Automated browser check that simulates adding history, triggering prediction, and verifying result or error states.",
  "frontend/src/features/prediction/PredictionPanel.tsx": "Renders prediction results, loading states, initialization/connection messages, and error views with retry options.",
  "frontend/src/features/prediction/useActorConnection.ts": "Tracks actor connection readiness, loading, and errors, and provides a retry function via React Query invalidation.",
  "frontend/src/features/prediction/usePrediction.ts": "Handles prediction requests, error categorization, retries, actor readiness checks, and resets when history clears.",
  "frontend/src/features/results/ResultsPanel.tsx": "Displays the latest prediction with timestamp and a compact three-row history of up to 30 items using styled UI components.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor based on Internet Identity, refreshing dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and hooks for managing Internet Identity authentication, including login, logout, and identity persistence.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating user profiles and predictions via the backend actor.",
  "frontend/src/index.css": "Sets up Tailwind base styles, theme variables, dark mode overrides, utility classes, and a loading fallback screen.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/utils/urlParams.ts": "Provides helpers for reading, persisting, and clearing URL and session parameters, including hash-based routing support.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, fonts, themes, plugins, and container settings using CSS variables.",
  "project_state.json": "Defines the project’s current specification, including a rolling 30-item Big/Small history, prediction logic requirements, UI gating rules, and a list of known issues. Also documents architectural notes and legacy feature definitions."
}