{
  "backend/main.mo": "Main backend actor implementing user profiles, prediction history storage (20-item rolling window), prediction feedback tracking with accuracy/streak metrics, bias analysis, and historical pattern upload with access control authorization.",
  "feature_evidence.json": "Feature evidence report documenting four implemented features: Win/Loss feedback buttons in UI, feedback storage in local state, historical pattern upload UI, and frontend-to-backend feedback data passing for prediction refinement.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend files describing the React application structure with prediction feedback, pattern upload, history management, authentication, and UI components using shadcn/ui and Tailwind.",
  "frontend/index.css": "Empty global stylesheet file (content appears to be in frontend/src/index.css instead).",
  "frontend/index.html": "HTML entry point with cache-control meta tags and a visible loading fallback spinner displayed before React mounts.",
  "frontend/src/App.tsx": "Main application component orchestrating gated history flow (20-item limit with Next button), prediction feedback state with Win/Loss recording, pattern upload handler, and wiring all child components together.",
  "frontend/src/components/AppErrorBoundary.tsx": "React Error Boundary component that catches render-time errors and displays a user-friendly error card with a reload button.",
  "frontend/src/features/auth/LoginButton.tsx": "Empty file (likely contains login/logout button component using Internet Identity based on frontend-file-summaries.txt).",
  "frontend/src/features/auth/ProfileSetupDialog.tsx": "Empty file (likely contains modal dialog for new user profile setup based on frontend-file-summaries.txt).",
  "frontend/src/features/auth/useCallerUserProfile.ts": "Empty file (likely contains wrapper hook for user profile queries based on frontend-file-summaries.txt).",
  "frontend/src/features/disclaimer/Disclaimer.tsx": "Warning card component displaying a disclaimer that predictions are heuristic, for informational purposes only, and not guaranteed accurate.",
  "frontend/src/features/history/HistoryControls.tsx": "Control panel with Big/Small entry buttons (disabled when history is full), Next button (shown at 20/20), Prediction button, Upload History button opening a dialog, and Clear All button with proper state management and test IDs.",
  "frontend/src/features/history/historyTypes.ts": "Defines the BigSmallResult type ('Big' | 'Small') with type guard and normalization utility functions for validating and converting string values.",
  "frontend/src/features/history/HistoryUploadDialog.tsx": "Dialog component for uploading historical Big/Small pattern data via text input, parsing comma or newline-separated entries, validating them, grouping into patterns of 3, and calling an upload callback.",
  "frontend/src/features/history/useGatedHistoryFlow.ts": "Hook implementing a 20/20 gated flow state machine that locks Big/Small buttons at 20 entries, unlocks for exactly one add after 'Next' is pressed, then immediately re-locks using a ref-backed token to prevent double-tap.",
  "frontend/src/features/history/useLocalHistory.ts": "Hook managing local history state with a rolling window of max 20 entries, providing functions to add, remove, clear, and set history items with timestamps.",
  "frontend/src/features/history/useRemoteHistory.ts": "Empty file with no content.",
  "frontend/src/features/prediction/predictionFlow.check.ts": "Automated test script that verifies the 20/20 gated prediction flow by simulating user interactions: adding 20 entries, checking button states, testing Next button unlock/re-lock behavior, and validating Clear All functionality.",
  "frontend/src/features/prediction/PredictionPanel.tsx": "Card component displaying prediction results, loading states, error states with categorized icons (backend unavailable, network error), retry buttons, and optional win/loss feedback buttons.",
  "frontend/src/features/prediction/useActorConnection.ts": "Hook wrapping useActor to provide connection status (isReady, isConnecting, hasError) and a retry function that invalidates the actor query to re-establish backend connection.",
  "frontend/src/features/prediction/usePrediction.ts": "Hook managing prediction generation with error categorization (backend_unavailable, network_error, unexpected_error), automatic error clearing when actor becomes ready, feedback submission before prediction, and retry functionality.",
  "frontend/src/features/prediction/usePredictionFeedback.ts": "Hook managing prediction feedback history with timestamps and win/loss flags, providing functions to add, clear, and retrieve feedback as a boolean array.",
  "frontend/src/features/results/ResultsPanel.tsx": "React component that displays a results dashboard with the latest prediction badge and a two-row history of up to 20 Big/Small entries, color-coded by result type.",
  "frontend/src/hooks/useActor.ts": "Custom React hook that creates and manages an authenticated or anonymous backend actor using Internet Identity, initializing access control with an admin token and invalidating dependent queries on actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context provider and hook for Internet Identity authentication, managing login state, identity persistence via AuthClient, and delegation validation with configurable idle options.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for backend operations including user profile management, prediction generation, feedback submission, and historical pattern uploads using the actor instance.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes using OKLCH color space, plus loading spinner styles for the pre-React mount fallback.",
  "frontend/src/main.tsx": "Application entry point that renders the root React component wrapped in QueryClientProvider and InternetIdentityProvider for state management and authentication.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting URL parameters from query strings or hash-based routing, with sessionStorage persistence and cleanup methods for sensitive parameters.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with dark mode support, custom color system using OKLCH color space, extended typography and container queries plugins, custom font families (Inter, JetBrains Mono), and keyframe animations for accordions and other UI elements.",
  "project_state.json": "Project state tracking document for a color trading signal app (Big/Small prediction) at version 27, documenting removal of authentication, 20-item rolling history with gated \"Next\" button, pattern detection requirements, and multiple known issues including poor prediction accuracy, missing UI elements, and non-functional tap-to-add behavior."
}