{
  "backend/main.mo": "Motoko canister managing user profiles, permission checks, history storage, and prediction logic with trend and streak analysis.",
  "feature_evidence.json": "Feature evidence report mapping feature IDs to related frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries of multiple frontend source files for documentation or build planning.",
  "frontend/index.css": "Empty stylesheet placeholder for global styles.",
  "frontend/index.html": "HTML entry point defining root container and loading fallback before React initializes.",
  "frontend/src/App.tsx": "Main React app wiring history, prediction, connection state, and UI panels into the dashboard layout.",
  "frontend/src/components/AppErrorBoundary.tsx": "React error boundary that shows a user-friendly fallback UI and reload option when rendering fails.",
  "frontend/src/features/auth/LoginButton.tsx": "Empty placeholder for the login button component.",
  "frontend/src/features/auth/ProfileSetupDialog.tsx": "Empty placeholder for the profile setup dialog component.",
  "frontend/src/features/auth/useCallerUserProfile.ts": "Empty placeholder for the caller user profile hook.",
  "frontend/src/features/disclaimer/Disclaimer.tsx": "Displays a warning card explaining that predictions are heuristic and not guaranteed.",
  "frontend/src/features/history/HistoryControls.tsx": "UI controls for adding Big/Small entries, clearing history, triggering predictions, and handling connection states.",
  "frontend/src/features/history/historyTypes.ts": "Defines Big/Small result types with helpers for validation and normalization.",
  "frontend/src/features/history/useGatedHistoryFlow.ts": "Implements a gated state machine allowing one history add after Next when count is 20, using a token to prevent double taps.",
  "frontend/src/features/history/useLocalHistory.ts": "Manages local history with add, remove, clear, and set functions, capped at 20 entries.",
  "frontend/src/features/history/useRemoteHistory.ts": "Empty placeholder file for remote history logic.",
  "frontend/src/features/prediction/predictionFlow.check.ts": "Automated DOM-based script to validate prediction flow by clicking UI elements and checking results or errors.",
  "frontend/src/features/prediction/PredictionPanel.tsx": "UI panel showing prediction status, loading, errors, and connection states with retry options.",
  "frontend/src/features/prediction/useActorConnection.ts": "Tracks actor connection readiness, provides connection state flags, and exposes a retry function.",
  "frontend/src/features/prediction/usePrediction.ts": "Handles prediction generation, error categorization, retries, and tracks prediction state tied to actor readiness.",
  "frontend/src/features/results/ResultsPanel.tsx": "Displays latest prediction and two-row compact history visualization with timestamps.",
  "frontend/src/hooks/useActor.ts": "Creates and manages backend actor based on identity, handling initialization and query invalidation on changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for Internet Identity authentication, exposing identity state, login, logout, and status helpers.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating user profile data, running predictions, and checking actor readiness.",
  "frontend/src/index.css": "Configures Tailwind base styles, theme variables, dark mode overrides, utilities, and a loading fallback screen.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClientProvider and InternetIdentityProvider and renders App.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, and clearing URL and session parameters, including hash-based routing support.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme colors, fonts, containers, shadows, animations, and enabling plugins.",
  "project_state.json": "Describes current project requirements, issues, and state for a Big/Small prediction app with a rolling 20-item history."
}