{
  "kind": "build_request",
  "title": "Increase rolling history capacity from 20 to 30 without changing any other behavior",
  "projectName": "Color Signal",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-37",
      "text": "Increase the local in-memory rolling history capacity from 20 entries to 30 entries, while preserving the existing as-entered chronological order and all current behaviors (tap-to-add, prediction triggering, and UI layout style) unchanged except where counts/limits must reflect 30.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-1"
        ],
        "quotes": [
          "ok করো \" তবে আর বাকি সবকিছুই 100% আগের মতোই থাকবে একটুও change যাতে না হয়"
        ]
      },
      "acceptanceCriteria": [
        "The app allows adding history entries until the visible counter reaches 30/30.",
        "When more than 30 entries would be added, history remains a rolling window capped at 30 entries (no crashes, no duplicate lists).",
        "The history order remains the same as currently displayed/used (as-entered sequence), with numbering continuing to reflect the current order logic (do not reverse)."
      ]
    },
    {
      "id": "REQ-38",
      "text": "Update the gated input flow to operate at 30/30 instead of 20/20: show the \"Next\" button whenever historyCount is 30; when historyCount is 30 and the gate is locked, disable Big/Small taps; pressing \"Next\" unlocks exactly one subsequent Big/Small tap; that single tap appends the new entry while keeping history length at 30 (oldest entry drops off), and then the gate re-locks until \"Next\" is pressed again.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-1"
        ],
        "quotes": [
          "ok করো \" তবে আর বাকি সবকিছুই 100% আগের মতোই থাকবে একটুও change যাতে না হয়"
        ]
      },
      "acceptanceCriteria": [
        "The \"Next\" button is visible when (and only when) historyCount is exactly 30.",
        "At 30/30 and locked, Big/Small buttons are disabled; after pressing \"Next\", exactly one Big/Small tap is accepted; immediately after that tap, Big/Small becomes disabled again until \"Next\" is pressed again.",
        "After the single allowed tap at full history, the history still shows 30 items and reflects a correct rolling window (one oldest entry removed, one new entry appended).",
        "All user-facing text introduced/updated for the gating flow remains in English (e.g., \"Next\", helper text)."
      ]
    },
    {
      "id": "REQ-39",
      "text": "Update all UI counters, helper text, and any hard-coded references from 20 to 30 so the interface consistently reflects the new 30-entry maximum without changing styling, component structure, or interactions beyond the required numeric updates.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-1"
        ],
        "quotes": [
          "ok করো \" তবে আর বাকি সবকিছুই 100% আগের মতোই থাকবে একটুও change যাতে না হয়"
        ]
      },
      "acceptanceCriteria": [
        "The Add Results badge shows X/30 (not X/20).",
        "The Results history label shows History (X/30).",
        "Any helper text that refers to being full reflects 30/30."
      ]
    },
    {
      "id": "REQ-40",
      "text": "Update the Results panel compact history visualization to render 30 entries in the same compact style, preserving the as-entered order and numbered labels, by extending the existing two-line layout to accommodate 30 items (e.g., three rows of 10) without changing the overall look-and-feel of the panel.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-1"
        ],
        "quotes": [
          "ok করো \" তবে আর বাকি সবকিছুই 100% আগের মতোই থাকবে একটুও change যাতে না হয়"
        ]
      },
      "acceptanceCriteria": [
        "With 1–30 entries, the Results panel shows all entries with correct numbering and the same color styling rules (Big=yellow, Small=blue).",
        "With 30 entries, all 30 are visible in the compact layout (no truncation) and the order matches the in-memory history sequence used for prediction.",
        "The panel continues to render correctly on typical mobile viewport widths (no overlapping text that makes entries unreadable)."
      ]
    },
    {
      "id": "REQ-41",
      "text": "Update the prediction request payload usage so predictions continue to work using the current in-memory history up to 30 items, and ensure no frontend logic assumes a 20-item maximum when generating or retrying predictions.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-1"
        ],
        "quotes": [
          "ok করো \" তবে আর বাকি সবকিছুই 100% আগের মতোই থাকবে একটুও change যাতে না হয়"
        ]
      },
      "acceptanceCriteria": [
        "Predictions can be generated successfully when history length is 1, 20, and 30.",
        "Retry behavior continues to work and uses the current in-memory history (up to 30) without errors."
      ]
    },
    {
      "id": "REQ-42",
      "text": "Update the backend history cap used by any remaining history storage utilities from 20 to 30 so internal limits do not conflict with the new 30-entry model, without re-introducing login requirements or changing the anonymous prediction flow.",
      "target": "backend",
      "source": {
        "messageIds": [
          "recent-1"
        ],
        "quotes": [
          "ok করো \" তবে আর বাকি সবকিছুই 100% আগের মতোই থাকবে একটুও change যাতে না হয়"
        ]
      },
      "acceptanceCriteria": [
        "Any backend capping logic that currently enforces 20 entries enforces 30 entries instead.",
        "The backend predictNext(history) continues to accept and process histories up to length 30 without trapping.",
        "Anonymous callers can still call predictNext(history) (no new authorization checks added)."
      ]
    },
    {
      "id": "REQ-43",
      "text": "Update the existing automated frontend prediction flow check (the DOM-based script) so it remains valid after switching to a 30-entry maximum (no assertions/logic that assume a 20-entry limit).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-1"
        ],
        "quotes": [
          "ok করো \" তবে আর বাকি সবকিছুই 100% আগের মতোই থাকবে একটুও change যাতে না হয়"
        ]
      },
      "acceptanceCriteria": [
        "Running the check via ?checkPrediction=1 still produces a PASS when backend is available.",
        "The check does not fail due to any hard-coded 20-entry assumptions."
      ]
    }
  ],
  "constraints": [
    "Do not change any existing behaviors, styling, layout structure, or user-facing flows other than updating limits/counters/gating from 20 to 30 where strictly required.",
    "Keep all user-facing UI text in English.",
    "Frontend immutable paths must not be modified: frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, frontend/src/components/ui.",
    "Backend must remain a single Motoko actor in backend/main.mo; only add migration code if an upgrade requires state changes."
  ],
  "nonGoals": [
    "Do not add or reintroduce Internet Identity login/logout UI or per-user persistence messaging.",
    "Do not redesign the visual theme or change button colors (Big must remain yellow; Small must remain blue).",
    "Do not claim or implement any guaranteed accuracy target (e.g., 99.99%); only adjust the history window size to 30.",
    "Do not add new backend services or external databases."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}