{
  "kind": "build_request",
  "title": "Add Win/Loss feedback buttons and improve pattern-based prediction logic",
  "projectName": "Signal Predictor",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-48",
      "text": "Add two new buttons labeled 'Win' and 'Loss' in the UI that appear after a prediction is generated, allowing the user to report whether the prediction was correct (Win) or incorrect (Loss).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-user-feedback-request"
        ],
        "quotes": [
          "win loss নামে 2 টা বাটন রাখবা তাহলে app signal দেওেয়ার পর আমি app কে জানাবো যে win নাকী loss"
        ]
      },
      "acceptanceCriteria": [
        "Win and Loss buttons are visible after a prediction is displayed",
        "Buttons are labeled 'Win' and 'Loss' in English",
        "Tapping Win or Loss records the feedback for that prediction"
      ]
    },
    {
      "id": "REQ-49",
      "text": "Store win/loss feedback in local state alongside the prediction history so the app can track which predictions were correct and which were incorrect.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-user-feedback-request"
        ],
        "quotes": [
          "সে হিসেবে এবং history অনুযায়ী signal predict করবে app"
        ]
      },
      "acceptanceCriteria": [
        "Each prediction can be associated with a win or loss outcome",
        "Feedback is stored locally (in-memory) for use in future predictions",
        "Feedback persists as long as the session is active"
      ]
    },
    {
      "id": "REQ-50",
      "text": "Update the backend prediction algorithm to accept an array of win/loss feedback (corresponding to recent predictions) and incorporate this feedback into the prediction logic to learn from past accuracy and adjust future predictions accordingly.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-user-feedback-request"
        ],
        "quotes": [
          "সে হিসেবে এবং history অনুযায়ী signal predict করবে app"
        ]
      },
      "acceptanceCriteria": [
        "Backend predictNext function accepts an optional feedback array parameter",
        "Prediction logic uses feedback to identify which patterns led to wins vs losses",
        "Algorithm adjusts its pattern detection strategy based on feedback"
      ]
    },
    {
      "id": "REQ-51",
      "text": "Improve the backend prediction algorithm to better analyze the 20-item Big/Small history for patterns, trends, streaks, reversals, and alternation, reducing the tendency to predict Big excessively and minimizing consecutive loss streaks (reported up to 8 losses in a row).",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-user-feedback-request"
        ],
        "quotes": [
          "Signal ভালো দিচ্ছে না টানা 8 টাও loss হয়ে যায়",
          "এখানে বেশিরভাগ সময় ই big এ signal  দেয়",
          "কোনো কিছু বুঝে app signal দেয় না"
        ]
      },
      "acceptanceCriteria": [
        "Prediction logic analyzes recent history for streaks (consecutive Big or Small)",
        "Prediction logic detects alternating patterns (zig-zag between Big and Small)",
        "Prediction logic identifies reversals after long streaks",
        "Algorithm balances Big and Small predictions based on actual history distribution",
        "Consecutive loss streaks are reduced by improving pattern recognition"
      ]
    },
    {
      "id": "REQ-52",
      "text": "Add a UI feature that allows the user to upload or input historical pattern data from old market results so the app can learn from past patterns and improve prediction accuracy for new patterns.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-user-feedback-request"
        ],
        "quotes": [
          "আমি Market এর old pattern গুলা থেকে new pattern এর দিকে history upload করবো"
        ]
      },
      "acceptanceCriteria": [
        "UI provides an input mechanism for uploading or entering historical Big/Small pattern sequences",
        "User can submit old pattern history to supplement the current 20-item rolling history",
        "Uploaded pattern data is sent to the backend for analysis"
      ]
    },
    {
      "id": "REQ-53",
      "text": "Update the backend to accept and store uploaded historical pattern data from the user, and incorporate this data into the prediction algorithm to improve pattern recognition and prediction accuracy over time.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-user-feedback-request"
        ],
        "quotes": [
          "আমি Market এর old pattern গুলা থেকে new pattern এর দিকে history upload করবো"
        ]
      },
      "acceptanceCriteria": [
        "Backend accepts uploaded historical pattern sequences",
        "Uploaded patterns are stored (in-memory or stable storage) for analysis",
        "Prediction algorithm uses both current rolling history and uploaded historical patterns to improve accuracy"
      ]
    },
    {
      "id": "REQ-54",
      "text": "Update the frontend to pass win/loss feedback data to the backend when generating a new prediction, so the backend can use this feedback to refine its prediction strategy.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-user-feedback-request"
        ],
        "quotes": [
          "সে হিসেবে এবং history অনুযায়ী signal predict করবে app"
        ]
      },
      "acceptanceCriteria": [
        "Frontend collects win/loss feedback for recent predictions",
        "Feedback data is included in the prediction request payload",
        "Backend receives and processes the feedback data"
      ]
    }
  ],
  "constraints": [
    "Maintain the single-actor backend architecture with all logic in backend/main.mo",
    "Preserve the existing 20-item rolling history capacity and gated input flow (20/20 Next button behavior)",
    "Keep all user-facing UI text in English",
    "Do not modify immutable frontend paths: useInternetIdentity, useActor, main.tsx, or frontend/src/components/ui",
    "Maintain anonymous user support (no login required)"
  ],
  "nonGoals": [
    "Changing the rolling history capacity from 20 entries",
    "Adding Internet Identity login or user authentication",
    "Implementing real-time synchronization or WebSocket features",
    "Integrating external AI services or third-party prediction APIs",
    "Changing the Big (yellow) and Small (blue) button color scheme"
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}