{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Add Win/Loss feedback buttons and improve pattern-based prediction logic",
  "requirements": [
    {
      "id": "REQ-48",
      "summary": "Add Win and Loss feedback buttons in the UI after a prediction is generated",
      "acceptanceCriteria": [
        "Win and Loss buttons are visible after a prediction is displayed",
        "Buttons are labeled 'Win' and 'Loss' in English",
        "Tapping Win or Loss records the feedback for that prediction"
      ],
      "file_operations": [
        {
          "path": "frontend/src/features/prediction/PredictionPanel.tsx",
          "operation": "modify",
          "description": "Add Win and Loss buttons below the prediction explanation that become visible when a prediction exists. Wire buttons to call a feedback handler callback passed from parent component. Disable buttons after feedback is recorded for the current prediction."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Add state to track feedback for current prediction. Pass feedback handler callback to PredictionPanel that records win/loss for the current prediction and stores it in local feedback history state."
        }
      ]
    },
    {
      "id": "REQ-49",
      "summary": "Store win/loss feedback in local state alongside prediction history",
      "acceptanceCriteria": [
        "Each prediction can be associated with a win or loss outcome",
        "Feedback is stored locally (in-memory) for use in future predictions",
        "Feedback persists as long as the session is active"
      ],
      "file_operations": [
        {
          "path": "frontend/src/features/prediction/usePredictionFeedback.ts",
          "operation": "create",
          "description": "Create a custom hook that manages an array of feedback objects linking prediction timestamps to win/loss boolean values. Provide methods to add feedback, retrieve feedback array, and clear feedback. Store feedback in React state for session persistence."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Import and use the usePredictionFeedback hook to manage feedback state. Wire feedback data to be included when requesting predictions from the backend."
        }
      ]
    },
    {
      "id": "REQ-52",
      "summary": "Add UI feature for uploading or inputting historical pattern data",
      "acceptanceCriteria": [
        "UI provides an input mechanism for uploading or entering historical Big/Small pattern sequences",
        "User can submit old pattern history to supplement the current 20-item rolling history",
        "Uploaded pattern data is sent to the backend for analysis"
      ],
      "file_operations": [
        {
          "path": "frontend/src/features/history/HistoryUploadDialog.tsx",
          "operation": "create",
          "description": "Create a dialog component with a textarea for entering comma-separated or line-separated Big/Small pattern sequences. Include validation to ensure only Big or Small values are accepted. Add a submit button that parses the input into an array of pattern sequences and calls a backend upload handler. Use shadcn/ui Dialog component for the modal."
        },
        {
          "path": "frontend/src/features/history/HistoryControls.tsx",
          "operation": "modify",
          "description": "Add an 'Upload History' button that opens the HistoryUploadDialog. Position it near the Clear All button in the controls section."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Add a useMutation hook for uploadHistoricalPatterns that calls actor.uploadHistoricalPatterns with the parsed pattern array. Include success/error toast notifications."
        }
      ]
    },
    {
      "id": "REQ-54",
      "summary": "Pass win/loss feedback data to backend when generating predictions",
      "acceptanceCriteria": [
        "Frontend collects win/loss feedback for recent predictions",
        "Feedback data is included in the prediction request payload",
        "Backend receives and processes the feedback data"
      ],
      "file_operations": [
        {
          "path": "frontend/src/features/prediction/usePrediction.ts",
          "operation": "modify",
          "description": "Update the mutation to accept an optional feedback array parameter. When calling actor.getPrediction, first call actor.updatePredictionFeedback with the feedback array if feedback exists, then proceed with the prediction request."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Pass the feedback array from usePredictionFeedback hook to the prediction mutation when triggering new predictions. Ensure feedback is synchronized before each prediction call."
        }
      ]
    }
  ]
}